<template>
    <div class="about-container">
      <h1>О нашем магазине</h1>
      <p>
        Добро пожаловать в наш онлайн магазин, специализирующийся на продаже товаров из Китая. Мы предлагаем широкий ассортимент продукции, включая электронику, одежду, аксессуары и многое другое. Наша цель — предоставить вам качественные товары по доступным ценам.
      </p>
      <p>
        Мы работаем напрямую с ведущими китайскими производителями, что позволяет нам предлагать вам самые низкие цены на рынке. Наши поставщики проверены временем, и мы гарантируем, что каждый товар проходит тщательную проверку перед отправкой к вам.
      </p>
      <p>
        В нашем магазине вы найдете новейшие тренды и самые популярные товары. Мы постоянно обновляем наш ассортимент, чтобы предложить вам только лучшее. Спасибо, что выбрали нас!
      </p>
    </div>
  </template>
  
  <script>
  export default {
    name: 'AboutSite',
  };
  </script>
  
  <style scoped>
  .about-container {
    background-color: #f9f9f9;
    padding: 20px;
    border-radius: 10px;
    box-shadow: 0 4px 8px rgba(0, 0, 0, 0.1);
  }
  
  h1 {
    color: #42b983;
    text-align: center;
    margin-bottom: 20px;
  }
  
  p {
    font-size: 18px;
    line-height: 1.6;
    color: #333;
    margin-bottom: 15px;
  }
  
  p:last-child {
    margin-bottom: 0;
  }
  </style>
  